In [1]:
import pandas as pd
import numpy as np
import warnings
import regex as re
from sqlalchemy import create_engine
warnings.filterwarnings('ignore')
pd.set_option('display.max_columns', None)

In [2]:
actor = pd.read_csv('../data/actor.csv')
category = pd.read_csv('../data/category.csv')
film = pd.read_csv('../data/film.csv')
inventory = pd.read_csv('../data/inventory.csv')
language = pd.read_csv('../data/language.csv')
film_actor = pd.read_csv('../data/old_HDD.csv')
rental = pd.read_csv('../data/rental.csv')

# ACTOR

In [3]:
actor.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [4]:
actor = actor.drop('last_update', axis=1) #la borro de todas la tablas. El contenido de estas está 
                                          #desfasado y tiene poca relevancia para el negocio

In [5]:
actor['name'] = actor.first_name + ' ' + actor.last_name #Concateno nombres y apellidos para poder trabajar mejor 
                                                         #con los datos de estos y las ID

In [6]:
actor.name

0         PENELOPE GUINESS
1            NICK WAHLBERG
2                 ED CHASE
3           JENNIFER DAVIS
4      JOHNNY LOLLOBRIGIDA
              ...
195            BELA WALKEN
196             REESE WEST
197            MARY KEITEL
198          JULIA FAWCETT
199           THORA TEMPLE
Name: name, Length: 200, dtype: object

In [7]:
actor = actor.drop(['first_name', 'last_name'], axis=1)

In [8]:
actor.drop_duplicates(subset = 'name', keep = 'first', inplace = True, ignore_index = True) 
#borramos a Susan Davies que sale repetida con dos id diferentes. Reiniciamos el índice.

In [9]:
actor.head()

   actor_id                 name
0         1     PENELOPE GUINESS
1         2        NICK WAHLBERG
2         3             ED CHASE
3         4       JENNIFER DAVIS
4         5  JOHNNY LOLLOBRIGIDA

In [10]:
category.head()

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

# CATEGORY

In [11]:
category.head(30)

    category_id         name          last_update
0             1       Action  2006-02-15 04:46:27
1             2    Animation  2006-02-15 04:46:27
2             3     Children  2006-02-15 04:46:27
3             4     Classics  2006-02-15 04:46:27
4             5       Comedy  2006-02-15 04:46:27
5             6  Documentary  2006-02-15 04:46:27
6             7        Drama  2006-02-15 04:46:27
7             8       Family  2006-02-15 04:46:27
8             9      Foreign  2006-02-15 04:46:27
9            10        Games  2006-02-15 04:46:27
10           11       Horror  2006-02-15 04:46:27
11           12        Music  2006-02-15 04:46:27
12           13          New  2006-02-15 04:46:27
13           14       Sci-Fi  2006-02-15 04:46:27
14           15       Sports  2006-02-15 04:46:27
15           16       Travel  2006-02-15 04:46:27

In [12]:
category = category.drop('last_update', axis=1)

In [13]:
category.name.value_counts()

Action         1
Animation      1
Children       1
Classics       1
Comedy         1
Documentary    1
Drama          1
Family         1
Foreign        1
Games          1
Horror         1
Music          1
New            1
Sci-Fi         1
Sports         1
Travel         1
Name: name, dtype: int64

In [14]:
new_row = pd.DataFrame([[0, 'no category']], columns=category.columns)
category = pd.concat([new_row, category]).reset_index(drop=True)
# añadimos una nueva categoría con valor 0, la llamamos 'no category'. Esto lo hacemos porque en film vamos a ver
# que hay películas donde no existe categoría. Cuando recorramos esa columna (category_id) rellenaremos los datos 
# vacíos con 0.

In [15]:
category.head()

   category_id         name
0            0  no category
1            1       Action
2            2    Animation
3            3     Children
4            4     Classics

# Film 1a parte

In [16]:
film.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [17]:
film.shape

(1000, 13)

In [18]:
film = film.drop(['original_language_id','last_update'], axis=1) 
#teniendo la columna de language no tiene sentido tener otr que viene a decir lo mismo. Además son todas las 
#películas en inglés. No tiene relevancia.

In [19]:
film.title.duplicated().sum() #comprobamos que no hayan duplicados en titles para que no nos de error

0

In [20]:
film.columns

Index(['film_id', 'title', 'description', 'release_year', 'language_id',
       'rental_duration', 'rental_rate', 'length', 'replacement_cost',
       'rating', 'special_features'],
      dtype='object')

In [21]:
film = film[['film_id', 'title', 'description', 'release_year','rental_duration', 'rental_rate', 
             'length', 'replacement_cost','rating', 'special_features', 'language_id']]

# Inventory

In [22]:
inventory.film_id.unique()

array([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
        15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,  27,
        28,  29,  30,  31,  32,  34,  35,  37,  39,  40,  42,  43,  44,
        45,  46,  47,  48,  49,  50,  51,  52,  53,  54,  55,  56,  57,
        58,  59,  60,  61,  62,  63,  64,  65,  66,  67,  68,  69,  70,
        71,  72,  73,  74,  75,  76,  77,  78,  79,  80,  81,  82,  83,
        84,  85,  86,  88,  89,  90,  91,  92,  93,  94,  95,  96,  97,
        98,  99, 100, 101, 102, 103, 104, 105, 106, 107, 109, 110, 111,
       112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124,
       125, 126, 127, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138,
       139, 140, 141, 142, 143, 145, 146, 147, 149, 150, 151, 152, 153,
       154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166,
       167, 168, 169, 170, 172, 173, 174, 175, 176, 177, 178, 179, 180,
       181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 193, 194,
       196, 197, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209,
       210, 211, 212, 213, 214, 215, 216, 218, 219, 220, 222, 223])

In [23]:
inventory.shape

(1000, 4)

In [24]:
inventory.head()

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17

In [25]:
inventory = inventory.drop(['last_update', 'store_id'], axis=1) #borro store_id porque solo habrá 1 tienda.

# Old_HDD

In [26]:
film_actor.head() #vamos a transformar este DF, aprovechando los datos que tiene, para que sea nuestra 
#tabla relacional entre film y actor.

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [27]:
film_actor['name'] = film_actor.first_name + ' ' + film_actor.last_name

In [28]:
film_actor = film_actor.drop(['first_name', 'last_name', 'release_year'], axis=1)
# no me va a hacer falta 'release_year' aquí. Además de tenerla también en film.

In [29]:
actor.head()

   actor_id                 name
0         1     PENELOPE GUINESS
1         2        NICK WAHLBERG
2         3             ED CHASE
3         4       JENNIFER DAVIS
4         5  JOHNNY LOLLOBRIGIDA

In [30]:
actor.name.value_counts()

PENELOPE GUINESS        1
KEVIN GARLAND           1
DARYL CRAWFORD          1
GRETA KEITEL            1
JANE JACKMAN            1
                       ..
MICHELLE MCCONAUGHEY    1
ADAM GRANT              1
SEAN WILLIAMS           1
GARY PENN               1
THORA TEMPLE            1
Name: name, Length: 199, dtype: int64

In [31]:
dict_actor = actor.set_index('name')['actor_id'].to_dict()
# vamos a crear un dict con los actores y sus ID. Trabajamos tanto con esta tabla como con la de actor para buscar los ID

In [32]:
film_actor['actor_id'] = [dict_actor[i] for i in film_actor.name]
#Creamos una columna que contenga los id de los actores de la columna contigua name.

In [33]:
dict_film = film.set_index('title')['film_id'].to_dict()
#Vamos a hacer lo mismo con los film_id y los metemos en este DF. Estamos trabajando en la tabla film.

In [34]:
film_actor['film_id'] = [dict_film[i] for i in film_actor.title]
#Creamos la columna

In [35]:
film_actor = film_actor[['actor_id','film_id','category_id','title','name']]#Reordeno las columnas para que tenga 
                                                                            #la misma estructura que nuestro DER

In [36]:
film_actor.head()

   actor_id  film_id  category_id                  title              name
0         1        1            6       ACADEMY DINOSAUR  PENELOPE GUINESS
1         1       23            2   ANACONDA CONFESSIONS  PENELOPE GUINESS
2         1       25           13            ANGELS LIFE  PENELOPE GUINESS
3         1      106           10  BULWORTH COMMANDMENTS  PENELOPE GUINESS
4         1      140           14          CHEAPER CLYDE  PENELOPE GUINESS

# Film 2a parte

In [39]:
dict_category = film_actor.set_index('title')['category_id'].to_dict()
#Volvemos con la tabla film una vez acabada Category. Vamos a aprovechar la tabla film_actor para relacionar los id 
#con sus películas

{'ACADEMY DINOSAUR': 6,
 'ANACONDA CONFESSIONS': 2,
 'ANGELS LIFE': 13,
 'BULWORTH COMMANDMENTS': 10,
 'CHEAPER CLYDE': 14,
 'COLOR PHILADELPHIA': 4,
 'ELEPHANT TROJAN': 11,
 'GLEAMING JAWBREAKER': 15,
 'HUMAN GRAFFITI': 10,
 'KING EVOLUTION': 8,
 'LADY STAGE': 11,
 'LANGUAGE COWBOY': 3,
 'MULHOLLAND BEAST': 9,
 'OKLAHOMA JUMANJI': 13,
 'RULES HUMAN': 11,
 'SPLASH GUMP': 8,
 'VERTIGO NORTHWEST': 5,
 'WESTWARD SEABISCUIT': 4,
 'WIZARD COLDBLOODED': 12,
 'ADAPTATION HOLES': 6,
 'APACHE DIVINE': 8,
 'BABY HALL': 9,
 'BULL SHAWSHANK': 1,
 'CHAINSAW UPTOWN': 14,
 'CHISUM BEHAVIOR': 8,
 'DESTINY SATURDAY': 13,
 'DRACULA CRYSTAL': 4,
 'FIGHT JAWBREAKER': 2,
 'FLASH WARS': 13,
 'GILBERT PELICAN': 4,
 'GOODFELLAS SALUTE': 14,
 'HAPPINESS UNITED': 9,
 'INDIAN LOVE': 8,
 'JEKYLL FROGMEN': 13,
 'JERSEY SASSY': 3,
 'LIAISONS SWEET': 16,
 'LUCKY FLYING': 12,
 'MAGUIRE APACHE': 8,
 'MALLRATS UNITED': 5,
 'MASK PEACH': 13,
 'ROOF CHAMPION': 10,
 'RUSHMORE MERMAID': 5,
 'SMILE EARRING': 16,
 'WARDROBE PHANTOM': 7,
 'ALONE TRIP': 12,
 'ARMY FLINTSTONES': 6,
 'ARTIST COLDBLOODED': 15,
 'BOONDOCK BALLROOM': 16,
 'CADDYSHACK JEDI': 1,
 'COWBOY DOOM': 9,
 'EVE RESURRECTION': 13,
 'FORREST SONS': 1,
 'FRENCH HOLIDAY': 6,
 'FROST HEAD': 4,
 'HALLOWEEN NUTS': 6,
 'HUNTER ALTER': 6,
 'IMAGE PRINCESS': 15,
 'JEEPERS WEDDING': 4,
 'LUCK OPUS': 7,
 'NECKLACE OUTBREAK': 7,
 'PLATOON INSTINCT': 13,
 'SPICE SORORITY': 7,
 'WEDDING APOLLO': 6,
 'WEEKEND PERSONAL': 14,
 'WHALE BIKINI': 9,
 'YOUNG LANGUAGE': 6,
 'BAREFOOT MANCHURIAN': 1,
 'BED HIGHBALL': 6,
 'BLADE POLISH': 7,
 'GHOSTBUSTERS ELF': 2,
 'GREEDY ROOTS': 7,
 'HANOVER GALAXY': 12,
 'INSTINCT AIRPORT': 15,
 'JUMANJI BLADE': 13,
 'NATIONAL STORY': 6,
 'POSEIDON FOREVER': 15,
 'RAIDERS ANTITRUST': 6,
 'RANDOM GO': 14,
 'REDS POCUS': 12,
 'SILVERADO GOLDFINGER': 14,
 'SUBMARINE BED': 5,
 'TREASURE COMMAND': 11,
 'UNFORGIVEN ZOOLANDER': 14,
 'AMADEUS HOLY': 1,
 'BANGER PINOCCHIO': 12,
 'BONNIE HOLOCAUST': 6,
 'CHITTY LOCK': 7,
 'COMMANDMENTS EXPRESS': 11,
 'CONEHEADS SMOOCHY': 7,
 'DADDY PITTSBURGH': 5,
 'DAISY MENAGERIE': 14,
 'ENOUGH RAGING': 16,
 'ESCAPE METROPOLIS': 16,
 'FIRE WOLVES': 10,
 'FRONTIER CABIN': 13,
 'GRAIL FRANKENSTEIN': 1,
 'GROOVE FICTION': 15,
 'HALL CASSIDY': 3,
 'HEAVENLY GUN': 12,
 'KRAMER CHOCOLATE': 15,
 'LOVE SUICIDES': 11,
 'METAL ARMAGEDDON': 6,
 'PACIFIC AMISTAD': 6,
 'PATTON INTERVIEW': 11,
 'POCUS PULP': 6,
 'RIDGEMONT SUBMARINE': 13,
 'RINGS HEARTBREAKERS': 1,
 'SOLDIERS EVOLUTION': 14,
 'STAR OPERATION': 15,
 'SUNRISE LEAGUE': 2,
 'ANTITRUST TOMATOES': 1,
 'BANG KWAI': 8,
 'BEAST HUNCHBACK': 4,
 'BIKINI BORROWERS': 2,
 'CALENDAR GUNFIGHT': 9,
 'COAST RAINBOW': 6,
 'COLDBLOODED DARLING': 14,
 'CROSSROADS CASUALTIES': 2,
 'DROP WATERFRONT': 15,
 'IGBY MAKER': 16,
 'LESSON CLEOPATRA': 15,
 'LIBERTY MAGNIFICENT': 15,
 'POTLUCK MIXED': 2,
 'SPEED SUIT': 16,
 'TITANIC BOONDOCK': 2,
 'TRADING PINOCCHIO': 15,
 'WYOMING STORM': 13,
 'ANONYMOUS HUMAN': 15,
 'ARACHNOPHOBIA ROLLERCOASTER': 11,
 'BERETS AGENT': 1,
 'BREAKING HOME': 13,
 'COMMAND DARLING': 9,
 'CONFESSIONS MAGUIRE': 7,
 'DAZED PUNK': 10,
 'DECEIVER BETRAYED': 7,
 'DESTINATION JERK': 7,
 'EXCITEMENT EVE': 1,
 'GASLIGHT CRUSADE': 11,
 'HELLFIGHTERS SIERRA': 9,
 'MALKOVICH PET': 4,
 'OCTOBER SUBMARINE': 4,
 'OPEN AFRICAN': 14,
 'SAINTS BRIDE': 7,
 'SAVANNAH TOWN': 7,
 'SCISSORHANDS SLUMS': 9,
 'SLEEPLESS MONSOON': 2,
 'SLEEPY JAPANESE': 13,
 'STING PERSONAL': 13,
 'TOWN ARK': 9,
 'TRACY CIDER': 2,
 'TREATMENT JEKYLL': 7,
 'WAR NOTTING': 9,
 'WARLOCK WEREWOLF': 3,
 'CAMPUS REMEMBER': 1,
 'CLONES PINOCCHIO': 12,
 'CONQUERER NUTS': 7,
 'CROWDS TELEMARK': 14,
 'DANCES NONE': 1,
 'DRIVING POLISH': 12,
 'DURHAM PANKY': 15,
 'HANGING DEEP': 7,
 'LIGHTS DEER': 4,
 'LOSER HUSTLER': 15,
 'RUNNER MADIGAN': 12,
 'SCHOOL JACKET': 9,
 'SCORPION APOLLO': 7,
 'SUGAR WONKA': 2,
 'TOMORROW HUSTLER': 4,
 'VANISHING ROCKY': 12,
 'ANYTHING SAVANNAH': 11,
 'BIRCH ANTITRUST': 12,
 'CHOCOLAT HARRY': 8,
 'CHOCOLATE DUCK': 9,
 'CROOKED FROGMEN': 3,
 'CURTAIN VIDEOTAPE': 10,
 'DALMATIONS SWEDEN': 7,
 'HORROR REIGN': 16,
 'LAWLESS VISION': 2,
 'LEBOWSKI SOLDIERS': 7,
 'MAJESTIC FLOATS': 6,
 'PERDITION FARGO': 15,
 'PRIMARY GLASS': 1,
 'REEF SALUTE': 11,
 'SNATCHERS MONTEZUMA': 4,
 'SWEETHEARTS SUSPECTS': 3,
 'TIES HUNGER': 3,
 'TRAFFIC HOBBIT': 16,
 'UNTOUCHABLES SUNRISE': 6,
 'WATERFRONT DELIVERANCE': 1,
 'WILD APOLLO': 13,
 'ALABAMA DEVIL': 11,
 'DIVINE RESURRECTION': 10,
 'DRAGONFLY STRANGERS': 13,
 'GOLDFINGER SENSIBILITY': 7,
 'JAWBREAKER BROOKLYN': 12,
 'LIFE TWISTED': 5,
 'LORD ARIZONA': 1,
 'MOD SECRETARY': 6,
 'PREJUDICE OLEANDER': 4,
 'PUNK DIVORCE': 2,
 'REAP UNFAITHFUL': 11,
 'SHAKESPEARE SADDLE': 15,
 'TROUBLE DATE': 16,
 'USUAL UNTOUCHABLES': 9,
 'VACATION BOONDOCK': 14,
 'WON DARES': 12,
 'CANYON STOCK': 2,
 'ENCINO ELF': 10,
 'ENDING CROWDS': 13,
 'GANDHI KWAI': 8,
 'GODFATHER DIARY': 13,
 'HANDICAP BOONDOCK': 1,
 'HONEY TIES': 15,
 'HORN WORKING': 2,
 'MEET CHOCOLATE': 9,
 'MOONWALKER FOOL': 10,
 'OLEANDER CLUE': 12,
 'RACER EGG': 7,
 'STORY SIDE': 1,
 'STRANGERS GRAFFITI': 11,
 'THIN SAGEBRUSH': 6,
 'TOOTSIE PILOT': 3,
 'UPTOWN YOUNG': 3,
 'VELVET TERMINATOR': 5,
 'WEST LION': 7,
 'WORKER TARZAN': 16,
 'ALLEY EVOLUTION': 9,
 'ARABIA DOGMA': 11,
 'ARIZONA BANG': 4,
 'BOUND CHEAPER': 4,
 'BOWFINGER GABLES': 11,
 'BUNCH MINDS': 7,
 'CLEOPATRA DEVIL': 13,
 'CONNECTICUT TRAMP': 14,
 'DARES PLUTO': 2,
 'DATE SPEED': 8,
 'DAY UNFAITHFUL': 13,
 'DOORS PRESIDENT': 2,
 'FURY MURDER': 3,
 'HARDLY ROBBERS': 6,
 'HIGHBALL POTTER': 9,
 'HOLES BRANNIGAN': 15,
 'INDEPENDENCE HOTEL': 6,
 'LEATHERNECKS DWARFS': 16,
 'MONTEREY LABYRINTH': 11,
 'NOVOCAINE FLIGHT': 15,
 'PERFECT GROOVE': 5,
 'REUNION WITCHES': 7,
 'SMOKING BARBARELLA': 6,
 'STAGECOACH ARMAGEDDON': 1,
 'SWEDEN SHINING': 5,
 'TELEMARK HEARTBREAKERS': 2,
 'VIRGINIAN PLUTO': 6,
 'ATTRACTION NEWTON': 13,
 'CABIN FLASH': 3,
 'CHINATOWN GLADIATOR': 13,
 'CLASH FREDDY': 2,
 'CLUELESS BUCKET': 1,
 'DRIVER ANNIE': 15,
 'FRIDA SLIPPER': 9,
 'GALAXY SWEETHEARTS': 4,
 'GRINCH MASSAGE': 10,
 'GROUNDHOG UNCUT': 5,
 'HOMEWARD CIDER': 6,
 'INCH JET': 2,
 'LEGALLY SECRETARY': 3,
 'LION UNCUT': 5,
 'LOLITA WORLD': 8,
 'MODEL FISH': 3,
 'MOTIONS DETAILS': 11,
 'REBEL AIRPORT': 12,
 'RIDER CADDYSHACK': 15,
 'SNOWMAN ROLLERCOASTER': 2,
 'SPLENDOR PATTON': 3,
 'STEEL SANTA': 4,
 'TORQUE BOUND': 7,
 'ZHIVAGO CORE': 11,
 'CRANES RESERVOIR': 15,
 'DIRTY ACE': 10,
 'DONNIE ALLEY': 2,
 'DRIFTER COMMANDMENTS': 1,
 'DRUMS DYNAMITE': 11,
 'ENEMY ODDS': 12,
 'GORGEOUS BINGO': 3,
 'HIGH ENCINO': 11,
 'HILLS NEIGHBORS': 1,
 'HOBBIT ALIEN': 7,
 'IMPACT ALADDIN': 12,
 'ITALIAN AFRICAN': 16,
 'JAPANESE RUN': 11,
 'KENTUCKIAN GIANT': 11,
 'LOVELY JINGLE': 4,
 'LOVER TRUMAN': 4,
 'MUSSOLINI SPOILERS': 15,
 'POLISH BROOKLYN': 3,
 'SALUTE APOLLO': 13,
 'SATURDAY LAMBS': 15,
 'STOCK GLASS': 13,
 'STREETCAR INTENTIONS': 11,
 'TIGHTS DAWN': 15,
 'TRAP GUYS': 9,
 'TYCOON GATHERING': 10,
 'VOICE PEACH': 13,
 'BORROWERS BEDAZZLED': 2,
 'BUTCH PANTHER': 13,
 'CASSIDY WYOMING': 16,
 'EGYPT TENENBAUMS': 11,
 'EMPIRE MALKOVICH': 3,
 'FLYING HOOK': 2,
 'FUGITIVE MAGUIRE': 16,
 'HYDE DOCTOR': 4,
 'KISS GLORY': 9,
 'KNOCK WARLOCK': 5,
 'LUKE MUMMY': 2,
 'MAKER GABLES': 3,
 'MONTEZUMA COMMAND': 1,
 'NOON PAPI': 3,
 'ROSES TREASURE': 15,
 'SHANE DARKNESS': 16,
 'SIEGE MADRE': 8,
 'THEORY MERMAID': 2,
 'VOLCANO TEXAS': 10,
 'WEREWOLF LOLA': 1,
 'WONDERLAND CHRISTMAS': 14,
 'BLANKET BEVERLY': 8,
 'BROTHERHOOD BLANKET': 6,
 'CAROL TEXAS': 2,
 'DELIVERANCE MULHOLLAND': 6,
 'EAGLES PANKY': 13,
 'EARRING INSTINCT': 8,
 'EASY GLADIATOR': 1,
 'ENTRAPMENT SATISFACTION': 1,
 'GABLES METROPOLIS': 8,
 'IMPOSSIBLE PREJUDICE': 9,
 'MAGNIFICENT CHITTY': 4,
 'MIRACLE VIRTUAL': 2,
 'MISSION ZOOLANDER': 2,
 'REAR TRADING': 1,
 'SENSE GREEK': 15,
 'CAPER MOTIONS': 5,
 'CASPER DRAGONFLY': 3,
 'CAT CONEHEADS': 5,
 'CUPBOARD SINNERS': 6,
 'CYCLONE FAMILY': 9,
 'FEVER EMPIRE': 10,
 'FIDELITY DEVIL': 11,
 'GREATEST NORTH': 12,
 'IRON MOON': 4,
 'JAWS HARRY': 5,
 'LIES TREATMENT': 7,
 'MICROCOSMOS PARADISE': 3,
 'MOVIE SHAKESPEARE': 8,
 'MUMMY CREATURES': 15,
 'ROAD ROXANNE': 6,
 'SIDE ARK': 1,
 'SINNERS ATLANTIS': 11,
 'STRANGER STRANGERS': 3,
 'TADPOLE PARK': 4,
 'ATTACKS HATE': 14,
 'BOILED DARES': 16,
 'EARLY HOME': 2,
 'ELIZABETH SHANE': 15,
 'GUMP DATE': 16,
 'INNOCENT USUAL': 9,
 'INSIDER ARIZONA': 12,
 'JERK PAYCHECK': 4,
 'SLING LUKE': 4,
 'STATE WASTELAND': 10,
 'SUN CONFESSIONS': 14,
 'TEQUILA PAST': 3,
 'TUXEDO MILE': 15,
 'VIRGIN DAISY': 7,
 'ACE GOLDFINGER': 11,
 'CIRCUS YOUTH': 3,
 'CONTROL ANTHEM': 5,
 'DARN FORRESTER': 1,
 'DYNAMITE TARZAN': 4,
 'HATE HANDICAP': 5,
 'HOMICIDE PEACH': 8,
 'JACKET FRISCO': 7,
 'OSCAR GOLD': 2,
 'PELICAN COMFORTS': 6,
 'PERSONAL LADYBUGS': 12,
 'RAGING AIRPLANE': 14,
 'RUN PACIFIC': 13,
 'SADDLE ANTITRUST': 5,
 'SHAWSHANK BUBBLE': 16,
 'TAXI KICK': 12,
 'BEDAZZLED MARRIED': 8,
 'DINOSAUR SECRETARY': 8,
 'EGG IGBY': 6,
 'JUNGLE CLOSER': 13,
 'LOLA AGENT': 11,
 'LOSE INCH': 9,
 'LOVERBOY ATTACKS': 13,
 'MODERN DORADO': 6,
 'ORIENT CLOSER': 7,
 'PAJAMA JAWBREAKER': 4,
 'PATIENT SISTER': 4,
 'SAGEBRUSH CLUELESS': 6,
 'SHANGHAI TYCOON': 16,
 'WASTELAND DIVINE': 4,
 'WINDOW SIDE': 16,
 'AGENT TRUMAN': 9,
 'BORN SPINAL': 16,
 'CHICKEN HELLFIGHTERS': 6,
 'CLOSER BANG': 5,
 'HOME PITY': 12,
 'KILL BROTHERHOOD': 6,
 'LADYBUGS ARMAGEDDON': 10,
 'PINOCCHIO SIMON': 5,
 'PLUTO OLEANDER': 13,
 'PRIX UNDEFEATED': 8,
 'PULP BEVERLY': 11,
 'RIVER OUTLAW': 15,
 'SLEEPING SUSPECTS': 11,
 'THIEF PELICAN': 2,
 'TITANS JERK': 14,
 'UNBREAKABLE KARATE': 13,
 'EVOLUTION ALTER': 15,
 'EXPECATIONS NATURAL': 16,
 'GANGS PRIDE': 2,
 'HOOK CHARIOTS': 2,
 'JERICHO MULAN': 10,
 'JUMPING WRATH': 3,
 'ODDS BOOGIE': 8,
 'OUTLAW HANKY': 16,
 'RIGHT CRANES': 4,
 'SEATTLE EXPECATIONS': 7,
 'SKY MIRACLE': 1,
 'TROJAN TOMORROW': 14,
 'BLACKOUT PRIVATE': 2,
 'CANDIDATE PERDITION': 4,
 'CANDLES GRAPES': 10,
 'DIVIDE MONSTER': 14,
 'GOLDMINE TYCOON': 14,
 'HOCUS FRIDA': 8,
 'HOTEL HAPPINESS': 9,
 'IDENTITY LOVER': 14,
 'MAGNOLIA FORRESTER': 1,
 'OZ LIAISONS': 2,
 'SONS INTERVIEW': 2,
 'STREAK RIDGEMONT': 6,
 'VANISHED GARDEN': 13,
 'WOLVES DESIRE': 16,
 'YOUTH KICK': 12,
 'BLUES INSTINCT': 8,
 'CASUALTIES ENCINO': 1,
 'CONNECTION MICROCOSMOS': 5,
 'CROW GREASE': 1,
 'DOOM DANCING': 5,
 'FREEDOM CLEOPATRA': 5,
 'HAUNTED ANTITRUST': 16,
 'MOB DUFFEL': 7,
 'PANIC CLUB': 11,
 'PURE RUNNER': 5,
 'SEVEN SWARM': 10,
 'SPINAL ROCKY': 8,
 'AMERICAN CIRCUS': 1,
 'BOOGIE AMELIE': 12,
 'CITIZEN SHREK': 14,
 'DOUBLE WRATH': 2,
 'FICTION CHRISTMAS': 9,
 'MASSAGE IMAGE': 2,
 'SABRINA MIDNIGHT': 3,
 'BOULEVARD MOB': 13,
 'BRANNIGAN SUNRISE': 13,
 'BUCKET BROTHERHOOD': 16,
 'CRAFT OUTFIELD': 7,
 'FOOL MOCKINGBIRD': 1,
 'GUYS FALCON': 14,
 'LONELY ELEPHANT': 5,
 'MADISON TRAP': 6,
 'PITTSBURGH HUNCHBACK': 8,
 'RANGE MOONWALKER': 8,
 'SORORITY QUEEN': 9,
 'TEXAS WATCH': 11,
 'TRAIN BUNCH': 11,
 'TRAMP OTHERS': 5,
 'CIDER DESIRE': 6,
 'EFFECT GLADIATOR': 8,
 'FREDDY STORM': 11,
 'GAMES BOWFINGER': 16,
 'GLADIATOR WESTWARD': 8,
 'MOCKINGBIRD HOLLYWOOD': 1,
 'PILOT HOOSIERS': 8,
 'PRESIDENT BANG': 8,
 'SPIRIT FLINTSTONES': 11,
 'WONKA SEA': 2,
 'ALICE FANTASIA': 4,
 'ATLANTIS CAUSE': 8,
 'BEACH HEARTBREAKERS': 6,
 'DUCK RACER': 2,
 'GILMORE BOILED': 4,
 'LAMBS CINCINATTI': 10,
 'MAIDEN HOME': 13,
 'MIDNIGHT WESTWARD': 1,
 'NEIGHBORS CHARADE': 15,
 'NONE SPIKING': 14,
 'ROOM ROMAN': 2,
 'SHOOTIST SUPERFLY': 7,
 'SHRUNK DIVINE': 1,
 'SPY MILE': 10,
 'TELEGRAPH VOYAGE': 12,
 'WAIT CIDER': 2,
 'WIFE TURN': 6,
 'ALADDIN CALENDAR': 15,
 'CENTER DINOSAUR': 4,
 'CHAMBER ITALIAN': 12,
 'ENCOUNTERS CURTAIN': 7,
 'EXPRESS LONELY': 14,
 'HOURS RAGE': 13,
 'HUSTLER PARTY': 5,
 'JEOPARDY ENCINO': 4,
 'JOON NORTHWEST': 15,
 'MAGIC MALLRATS': 3,
 'MONEY HAROLD': 13,
 'OUTBREAK DIVINE': 10,
 'REIGN GENTLEMEN': 14,
 'SUMMER SCARFACE': 4,
 'BEETHOVEN EXORCIST': 7,
 'BEVERLY OUTLAW': 14,
 'BIRDS PERDITION': 13,
 'DUDE BLINDNESS': 15,
 'DUMBO LUST': 8,
 'FAMILY SWEET': 11,
 'FIREHOUSE VIETNAM': 1,
 'MATRIX SNOWMAN': 9,
 'SILENCE KANE': 12,
 'CLYDE THEORY': 13,
 'CRAZY HOME': 5,
 'FACTORY DRAGON': 16,
 'FERRIS MOTHER': 5,
 'GONE TROUBLE': 7,
 'GREEK EVERYONE': 9,
 'HOOSIERS BIRDCAGE': 9,
 'ROCKY WAR': 7,
 'WISDOM WORKER': 5,
 'BEHAVIOR RUNAWAY': 11,
 'CHAPLIN LICENSE': 13,
 'CRUSADE HONEY': 15,
 'DEEP CRUSADE': 6,
 'FEUD FROGMEN': 8,
 'FIDDLER LOST': 14,
 'HAROLD FRENCH': 7,
 'PACKER MADIGAN': 2,
 'PEACH INNOCENT': 15,
 'PEARL DESTINY': 9,
 'CHANCE RESURRECTION': 15,
 'DAUGHTER MADIGAN': 3,
 'DREAM PICKUP': 1,
 'FATAL HAUNTED': 13,
 'FEATHERS METAL': 10,
 'JUGGLER HARDLY': 2,
 'ROBBERS JOON': 3,
 'ROCK INSTINCT': 11,
 'TEEN APOLLO': 16,
 'TEMPLE ATTRACTION': 11,
 'WATERSHIP FRONTIER': 11,
 'WHISPERER GIANT': 14,
 'WRONG BEHAVIOR': 3,
 'DORADO NOTTING': 12,
 'GUNFIGHTER MUSSOLINI': 15,
 'KANE EXORCIST': 9,
 'LOATHING LEGALLY': 4,
 'PEAK FOREVER': 15,
 'REDEMPTION COMFORTS': 13,
 'SHIP WONDERLAND': 6,
 'SQUAD FISH': 15,
 'VOLUME HOUSE': 4,
 'BALLROOM MOCKINGBIRD': 9,
 'NASH CHOCOLAT': 2,
 'QUEST MUSSOLINI': 1,
 'ROCKETEER MOTHER': 9,
 'RUGRATS SHAKESPEARE': 1,
 'ALIEN CENTER': 9,
 'BLINDNESS GUN': 14,
 'GUN BONNIE': 10,
 'HEAVEN FREEDOM': 5,
 'INTOLERABLE INTENTIONS': 6,
 'MENAGERIE RUSHMORE': 2,
 'TALENTED HOMICIDE': 15,
 'TRUMAN CRAZY': 1,
 'VALENTINE VANISHING': 16,
 'WANDA CHAMBER': 10,
 'ALASKA PHANTOM': 12,
 'CARRIE BUNCH': 11,
 'FIREBALL PHILADELPHIA': 5,
 'INTRIGUE WORST': 9,
 'METROPOLIS COMA': 14,
 'PATHS CONTROL': 7,
 'STALLION SUNDANCE': 14,
 'STAMPEDE DISTURBING': 10,
 'UNITED PILOT': 6,
 'WATCH TRACY': 2,
 'WORKING MICROCOSMOS': 16,
 'ANALYZE HOOSIERS': 11,
 'CLUB GRAFFITI': 2,
 'CONGENIALITY QUEST': 15,
 'DESIRE ALIEN': 2,
 'FRISCO FORREST': 14,
 'GENTLEMEN STAGE': 9,
 'IDAHO LOVE': 13,
 'IDOLS SNATCHERS': 3,
 'KISSING DOLLS': 1,
 'LEGEND JEDI': 12,
 'PURPLE MOVIE': 9,
 'TARZAN VIDEOTAPE': 11,
 'BILKO ANONYMOUS': 8,
 'BINGO TALENTED': 14,
 'COMANCHEROS ENEMY': 3,
 'DESERT POSEIDON': 11,
 'EVERYONE CRAFT': 9,
 'EXORCIST STING': 15}

In [40]:
film['category_id'] = [dict_category.get(i, 0) for i in film.title] 
#como no estamos comparando dos lista iguales, esta vez saldría un error al subir a sql por lo titles que no tengan 
#category. Usamos entonces el método .get e incluimos un valor para los errores.

In [41]:
film.columns

Index(['film_id', 'title', 'description', 'release_year', 'rental_duration',
       'rental_rate', 'length', 'replacement_cost', 'rating',
       'special_features', 'language_id', 'category_id'],
      dtype='object')

# Film_actor 2a parte

In [42]:
film_actor = film_actor[['film_id','actor_id']] 
#Ya hemos sacado toda la info que nos interesaba de esta tabla. La estructuramos para ser tabla relacional.

# Language

In [43]:
language.shape

(6, 3)

In [44]:
language = language.drop(['last_update'], axis=1)

In [45]:
language.head()

   language_id      name
0            1   English
1            2   Italian
2            3  Japanese
3            4  Mandarin
4            5    French

# Rental

In [46]:
rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [47]:
rental = rental.drop(['last_update'], axis=1)

In [48]:
rental.dtypes

rental_id        int64
rental_date     object
inventory_id     int64
customer_id      int64
return_date     object
staff_id         int64
dtype: object

Después de analizar la tabla de rental. Tenemos en cuenta la estructura de esta para nuestro diagrama,
pero su contenido, al comenzar de nuevo la actividad, no es relevante para el negocio. Por lo que creamos
esta tabla vacía, junto con customers y staff

# Repaso final para ver que cada tabla este correctamente estructurada como el diagrama

In [49]:
actor.head()

   actor_id                 name
0         1     PENELOPE GUINESS
1         2        NICK WAHLBERG
2         3             ED CHASE
3         4       JENNIFER DAVIS
4         5  JOHNNY LOLLOBRIGIDA

In [50]:
category.head()

   category_id         name
0            0  no category
1            1       Action
2            2    Animation
3            3     Children
4            4     Classics

In [51]:
film.head()

,film_id,title,description,release_year,rental_duration,rental_rate,length,replacement_cost,rating,special_features,language_id,category_id
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",1,6
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",1,11
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",1,6
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",1,0
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,6,2.99,130,22.99,G,Deleted Scenes,1,0

inventory.head()

In [53]:
language.head()

   language_id      name
0            1   English
1            2   Italian
2            3  Japanese
3            4  Mandarin
4            5    French

In [54]:
film_actor.head()

   film_id  actor_id
0        1         1
1       23         1
2       25         1
3      106         1
4      140         1

Comprobadas las estructuras de cada tabla. Las subimos a SQL

# Subimos la información de las tablas a SQL

In [55]:
str_conn = 'mysql+pymysql://root:XXXXXXXX@localhost:3306/blockbuster'

cursor = create_engine(str_conn)

In [61]:
actor.to_sql(name='Actor', 
            con=cursor,
            if_exists='append',
            index=False
           )

199

In [62]:
category.to_sql(name='Category', 
            con=cursor,
            if_exists='append',
            index=False
           )

17

In [63]:
language.to_sql(name='Language', 
            con=cursor,
            if_exists='append',
            index=False
           )

6

In [64]:
film.to_sql(name='Films', 
            con=cursor,
            if_exists='append',
            index=False
           )

1000

In [65]:
inventory.to_sql(name='Inventory', 
            con=cursor,
            if_exists='append',
            index=False
           )

1000

In [66]:
film_actor.to_sql(name='film_actor', 
            con=cursor,
            if_exists='append',
            index=False
           )

1000